In [1]:
import webbrowser
website="http://en.wikipedia.org/wiki/NFL_win-loss_records"
webbrowser.open(website)

True

In [41]:
import pandas as pd
import numpy as np
from pandas import DataFrame

In [5]:
nf1=pd.read_clipboard()

In [159]:
nf1

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,502,374,6,0.573,1960,882,NFC East
1,2,Green Bay Packers,737,562,37,0.565,1921,"1,336",NFC North
2,3,Chicago Bears,749,579,42,0.562,1920,"1,370",NFC North
3,4,Miami Dolphins,445,351,4,0.559,1966,800,AFC East
4,5,New England Patriots[b],489,386,9,0.558,1960,884,AFC East

In [162]:
nf1[nf1.Won>502][['Won','Lost']]

   Won  Lost
1  737   562
2  749   579

In [7]:
nf1.columns

Index(['Rank', 'Team', 'Won', 'Lost', 'Tied', 'Pct.', 'First NFL Season',
       'Total Games', 'Division'],
      dtype='object')

In [8]:
nf1.Rank

0    1
1    2
2    3
3    4
4    5
Name: Rank, dtype: int64

In [11]:
nf1["First NFL Season"]

0    1960
1    1921
2    1920
3    1966
4    1960
Name: First NFL Season, dtype: int64

In [14]:
##it will give error
# nf1.First NFL Season

In [17]:
#If we want to create a new dataframe from particular columns 
DataFrame(nf1,columns=["Team","First NFL Season","Total Games"])

                      Team  First NFL Season Total Games
0           Dallas Cowboys              1960         882
1        Green Bay Packers              1921       1,336
2            Chicago Bears              1920       1,370
3           Miami Dolphins              1966         800
4  New England Patriots[b]              1960         884

In [18]:
DataFrame(nf1,columns=["Team","First NFL Season","Total Games","Stadium"])

                      Team  First NFL Season Total Games  Stadium
0           Dallas Cowboys              1960         882      NaN
1        Green Bay Packers              1921       1,336      NaN
2            Chicago Bears              1920       1,370      NaN
3           Miami Dolphins              1966         800      NaN
4  New England Patriots[b]              1960         884      NaN

In [19]:
#first two rows
nf1.head(2)

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,502,374,6,0.573,1960,882,NFC East
1,2,Green Bay Packers,737,562,37,0.565,1921,"1,336",NFC North

In [20]:
#last two rows
nf1.tail(2)

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
3,4,Miami Dolphins,445,351,4,0.559,1966,800,AFC East
4,5,New England Patriots[b],489,386,9,0.558,1960,884,AFC East

In [22]:
nf1.head()

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,502,374,6,0.573,1960,882,NFC East
1,2,Green Bay Packers,737,562,37,0.565,1921,"1,336",NFC North
2,3,Chicago Bears,749,579,42,0.562,1920,"1,370",NFC North
3,4,Miami Dolphins,445,351,4,0.559,1966,800,AFC East
4,5,New England Patriots[b],489,386,9,0.558,1960,884,AFC East

In [24]:
nf1.ix[3]

C:\Users\Administrator\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

Rank                             4
Team                Miami Dolphins
Won                            445
Lost                           351
Tied                             4
Pct.                         0.559
First NFL Season              1966
Total Games                    800
Division                  AFC East
Name: 3, dtype: object

In [25]:
#data from row and column
nf1.ix[1,2]

737

In [38]:
nf1.ix[1:3,1]

1    Green Bay Packers
2        Chicago Bears
3       Miami Dolphins
Name: Team, dtype: object

In [37]:
nf1.ix[1:3,2:5]

   Won  Lost  Tied
1  737   562    37
2  749   579    42
3  445   351     4

In [29]:
#Add a new column
nf1["Stadium"]="Levi's Stadium"

In [30]:
nf1

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadium
0,1,Dallas Cowboys,502,374,6,0.573,1960,882,NFC East,Levi's Stadium
1,2,Green Bay Packers,737,562,37,0.565,1921,"1,336",NFC North,Levi's Stadium
2,3,Chicago Bears,749,579,42,0.562,1920,"1,370",NFC North,Levi's Stadium
3,4,Miami Dolphins,445,351,4,0.559,1966,800,AFC East,Levi's Stadium
4,5,New England Patriots[b],489,386,9,0.558,1960,884,AFC East,Levi's Stadium

In [43]:
nf1["Stadium"]=np.arange(5)
nf1

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadium
0,1,Dallas Cowboys,502,374,6,0.573,1960,882,NFC East,0
1,2,Green Bay Packers,737,562,37,0.565,1921,"1,336",NFC North,1
2,3,Chicago Bears,749,579,42,0.562,1920,"1,370",NFC North,2
3,4,Miami Dolphins,445,351,4,0.559,1966,800,AFC East,3
4,5,New England Patriots[b],489,386,9,0.558,1960,884,AFC East,4

In [47]:
Stadiums=pd.Series(["Levi's Stadium","AT Stadium"],index=[4,0])
Stadiums

4    Levi's Stadium
0        AT Stadium
dtype: object

In [48]:
nf1["Stadium"]=Stadiums

In [49]:
nf1

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadium
0,1,Dallas Cowboys,502,374,6,0.573,1960,882,NFC East,AT Stadium
1,2,Green Bay Packers,737,562,37,0.565,1921,"1,336",NFC North,NaN
2,3,Chicago Bears,749,579,42,0.562,1920,"1,370",NFC North,NaN
3,4,Miami Dolphins,445,351,4,0.559,1966,800,AFC East,NaN
4,5,New England Patriots[b],489,386,9,0.558,1960,884,AFC East,Levi's Stadium

In [50]:
# Delet a column from data fram
del nf1["Stadium"]

In [109]:
# create dataframe
data = {"date" : [ "December,2014", "December, 2013","December, 2012","December,2011"], "global_temp": [0.87,0.74,0.65,0.63]
       }
dataframe = pd.DataFrame(data)
dataframe

             date  global_temp
0   December,2014         0.87
1  December, 2013         0.74
2  December, 2012         0.65
3   December,2011         0.63

In [111]:
dataframe.date
dataframe["date"]

0     December,2014
1    December, 2013
2    December, 2012
3     December,2011
Name: date, dtype: object

In [115]:
# if u dont want index
print(dataframe['date'].values)

['December,2014' 'December, 2013' 'December, 2012' 'December,2011']

In [117]:
dataframe.tail(n=2)

             date  global_temp
2  December, 2012         0.65
3   December,2011         0.63

In [118]:
print(dataframe.describe())

       global_temp
count     4.000000
mean      0.722500
std       0.109354
min       0.630000
25%       0.645000
50%       0.695000
75%       0.772500
max       0.870000

In [121]:
dataframe.sort_values(by="global_temp")

             date  global_temp
3   December,2011         0.63
2  December, 2012         0.65
1  December, 2013         0.74
0   December,2014         0.87

In [136]:
data={'city':['p','r','t'],'population':[48,68,34]}

In [137]:
df=DataFrame(data)
print(df)

  city  population
0    p          48
1    r          68
2    t          34

In [141]:
df[0:2][['city']]

  city
0    p
1    r

In [59]:
 from numpy.random import randn

In [60]:
df=pd.DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'],columns=['Col1','Col2','Col3','Col4','Col5'])

In [61]:
df

       Col1      Col2      Col3      Col4      Col5
A  0.134269 -1.075004  0.170499 -1.539233  1.115503
B  0.222201 -1.035813  0.885161 -1.871504  2.863660
D  1.473200 -1.254598  1.431804 -2.107087 -0.899252
E  0.365336 -0.027535 -1.587481  0.795549  1.288049
F -0.706142 -0.168736  1.125842  0.547237  0.097250

In [63]:
#reindex

df1=df.reindex(['A','B','C','D','E','F'])
df1

       Col1      Col2      Col3      Col4      Col5
A  0.134269 -1.075004  0.170499 -1.539233  1.115503
B  0.222201 -1.035813  0.885161 -1.871504  2.863660
C       NaN       NaN       NaN       NaN       NaN
D  1.473200 -1.254598  1.431804 -2.107087 -0.899252
E  0.365336 -0.027535 -1.587481  0.795549  1.288049
F -0.706142 -0.168736  1.125842  0.547237  0.097250

In [69]:
new_columns=['Col1','Col2','Col3','Col4','Col5','Col6']

In [75]:
#reindexing of Columns
df1.reindex(columns=new_columns)
#or
df.ix[['A','B','C','D','E','F'],new_columns]

       Col1      Col2      Col3      Col4      Col5  Col6
A  0.134269 -1.075004  0.170499 -1.539233  1.115503   NaN
B  0.222201 -1.035813  0.885161 -1.871504  2.863660   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  1.473200 -1.254598  1.431804 -2.107087 -0.899252   NaN
E  0.365336 -0.027535 -1.587481  0.795549  1.288049   NaN
F -0.706142 -0.168736  1.125842  0.547237  0.097250   NaN

In [79]:
# Drop entries from dataframe
df1.drop('A')

       Col1      Col2      Col3      Col4      Col5
B  0.222201 -1.035813  0.885161 -1.871504  2.863660
C       NaN       NaN       NaN       NaN       NaN
D  1.473200 -1.254598  1.431804 -2.107087 -0.899252
E  0.365336 -0.027535 -1.587481  0.795549  1.288049
F -0.706142 -0.168736  1.125842  0.547237  0.097250

In [77]:
df1.drop('Col1',axis=1) #by default axis is o which is for row

       Col2      Col3      Col4      Col5
A -1.075004  0.170499 -1.539233  1.115503
B -1.035813  0.885161 -1.871504  2.863660
C       NaN       NaN       NaN       NaN
D -1.254598  1.431804 -2.107087 -0.899252
E -0.027535 -1.587481  0.795549  1.288049
F -0.168736  1.125842  0.547237  0.097250

In [80]:
df

       Col1      Col2      Col3      Col4      Col5
A  0.134269 -1.075004  0.170499 -1.539233  1.115503
B  0.222201 -1.035813  0.885161 -1.871504  2.863660
D  1.473200 -1.254598  1.431804 -2.107087 -0.899252
E  0.365336 -0.027535 -1.587481  0.795549  1.288049
F -0.706142 -0.168736  1.125842  0.547237  0.097250

In [134]:
df[['Col1','Col2']]

       Col1      Col2
A  0.134269 -1.075004
B  0.222201 -1.035813
D  1.473200 -1.254598
E  0.365336 -0.027535
F -0.706142 -0.168736

In [86]:
df[df['Col1']>1]

     Col1      Col2      Col3      Col4      Col5
D  1.4732 -1.254598  1.431804 -2.107087 -0.899252

In [87]:
df>1

    Col1   Col2   Col3   Col4   Col5
A  False  False  False  False   True
B  False  False  False  False   True
D   True  False   True  False  False
E  False  False  False  False   True
F  False  False   True  False  False

In [88]:
df.ix["A"]

Col1    0.134269
Col2   -1.075004
Col3    0.170499
Col4   -1.539233
Col5    1.115503
Name: A, dtype: float64

In [90]:
df.ix[1]

Col1    0.222201
Col2   -1.035813
Col3    0.885161
Col4   -1.871504
Col5    2.863660
Name: B, dtype: float64

In [93]:
df1=DataFrame(np.arange(4).reshape(2,2),columns=list('ab'),index=['py','tl'])

In [94]:
df1

    a  b
py  0  1
tl  2  3

In [95]:
df2=DataFrame(np.arange(9).reshape(3,3),columns=list('adc'),index=['py','qr','tl'])

In [96]:
df2

    a  d  c
py  0  1  2
qr  3  4  5
tl  6  7  8

In [97]:
df1+df2

      a   b   c   d
py  0.0 NaN NaN NaN
qr  NaN NaN NaN NaN
tl  8.0 NaN NaN NaN

In [98]:
df1.add(df2,fill_value=0)

      a    b    c    d
py  0.0  1.0  2.0  1.0
qr  3.0  NaN  5.0  4.0
tl  8.0  3.0  8.0  7.0

In [101]:
ser=df2.ix[0]
print(ser)

a    0
d    1
c    2
Name: py, dtype: int32

In [127]:
df2-ser

    a  d  c
py  0  0  0
qr  3  3  3
tl  6  6  6

In [142]:
##### loc,iloc,ix

In [143]:
df = pd.DataFrame({'A' : [4,5,6,7],
                   'B' : [10,20,30,40],
                   'C' : [100,50,-30,-50]})
df.index = ['aa', 'aa', 'bb', 'cc']
print(df)

    A   B    C
aa  4  10  100
aa  5  20   50
bb  6  30  -30
cc  7  40  -50

In [144]:
# label based indexing. 
# loc[label of the row as a list , label of the column as a list]
print(df.loc['aa'])

#to print the rows indexed as aa and bb
print(df.loc[['aa','bb']])

    A   B    C
aa  4  10  100
aa  5  20   50
    A   B    C
aa  4  10  100
aa  5  20   50
bb  6  30  -30

In [151]:
print(df.loc[['aa','bb'], ['A', 'B']])

    A   B
aa  4  10
aa  5  20
bb  6  30

In [147]:
# positional indexing
print(df.iloc[0:3])

    A   B    C
aa  4  10  100
aa  5  20   50
bb  6  30  -30

In [150]:
print (df.iloc[[2,3],[0, 1]])

    A   B
bb  6  30
cc  7  40

In [152]:
print(df.ix['aa', :3])

    A   B    C
aa  4  10  100
aa  5  20   50

C:\Users\Administrator\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [154]:
#print 1,3rows of columns A, B 
print(df.ix[[1,3],['A','B']])

    A   B
aa  5  20
cc  7  40

In [155]:
#subsetting
#Fetch A and B columns of the df for all A values >= 5
df[df.A>=5][['A','B']] # or df[df[A]>=5][['A','B']]

    A   B
aa  5  20
bb  6  30
cc  7  40

In [158]:
# Print all A vlaues and B Values for which A>=5 and B>20
df[(df.A>=5) & (df.B>20)][['A','B']]

    A   B
bb  6  30
cc  7  40